#1. ให้เขียนโปรแกรมเพื่อรับค่าตัวเลข 3 จำนวนจากนั้นให้หาค่าที่มีค่าน้อยที่สุดในสามจำนวนนั้น
'''
a = int(input())
b = int(input())
c = int(input())
abc = [a,b,c]
print(min(abc))'''
#2. ให้เขียนโปรแกรมเพื่อรับค่าตัวเลขจำนวนเต็ม ไปเรื่อยๆ จนกว่าผู้ใช้จะผู้ใช้จะพิมพ์ค่า 0 จากนั้นให้แสดงผลรวมของเลขจำนวนที่ผู้ใช้พิมพ์
'''
a = int(input())
sum = 0
while not a == 0:
    sum += a
    a = int(input())
print(sum)'''
#3.ให้เขียนโปรแกรมเพื่อรับค่าเลขจำนวนเต็มบวก 1 จำนวน (n) จากนั้นจะต้องรับค่าอีกจำนวน n ค่า จากนั้นให้หาผลบวกของตัวเลขคี่จากเลขทั้ง n จำนวนนั้น
'''
a = int(input())
sum = 0
for i in range(a):
    a = int(input())
    if not a % 2 == 0:
        sum += a
print(sum)'''
#ให้ L เป็นลำดับของเลขจำนวนเต็ม จำนวน n ตัว ให้หาลำดับของเลขที่มีค่าใกล้กับค่าเฉลี่ยมากที่สุด

L = [1,2,3,4,5,6,7,8,9]
val = len(L)
avgofL = sum(L)/val
close_val = []
for i in L:
    close_val.append(abs(i-avgofL))
ans = L.index(min(close_val)+avgofL)
print(ans)


#ให้ L เป็นลำดับของเลขจำนวนเต็มจำนวน n ตัวให้หาตำแหน่งของตัวเลขที่มีค่าที่มากที่สุดที่น้อยกว่าค่าเฉลี่ย
'''
L = [569,981,782,739,150,301,416,125,68,847]
n = len(L)
ค่าที่ใก้ลที่สุด = 0
ค่าเฉลี่ยของL = sum(L)/n
for x in L:
    if x < ค่าเฉลี่ยของL and ค่าที่ใก้ลที่สุด < x:
        ค่าที่ใก้ลที่สุด = x
print(L.index(ค่าที่ใก้ลที่สุด))
'''
#ให้ L เป็นลำดับของเลขจำนวนเต็มจำนวน n ตัว
#ให้หาตำแหน่งเริ่มต้นของตัวเลข (ตั้งแต่ตำแหน่ง 0 ถึง n-3)
#  ที่มีเลขในลำดับถัดไปอีก 2 ลำดับ (รวมตัวเอง) ทั้งหมด 3 จำนวน เรียงจากน้อยไปหามาก
#เช่น 1,2,1,2,1,2,3,1,2,1
#ตอบ ตำแหน่งที่ 4 เพราะ ตำแหน่งที่ 4 มีค่าเป็น 1 และตำแหน่งที่ 5,6 มีค่าเป็น 2,3 ตามลำดับทำให้
#1,2,3 เป็นเลขที่เรียงกันจากน้อยไปหามากตำแหน่งแรก
'''
L = [1,2,1,2,1,2,3,1,2,1]
n =len(L)
ลำดับ = 'none'
for x in range(n-3) :
    if L[x]<L[x+1]<L[x+2] and L[x+1]< L[x+2]:
        ลำดับ =  x
print(ลำดับ)
'''
#จงเขียนเกมที่มีผู้เล่นสองคน ผู้เล่นจะสลับกันกรอกข้อมูลตัวเลขจำนวนเต็ม ที่มีค่า 1 จนถึง 13 
#ผู้เล่นคนใดกรอกตัวเลขแล้วทำให้ผลรวมของตัวเลขทั้งหมดมีค่ามากกว่า 99 จะถือว่าผู้เล่นคนดังกล่าวแพ้
#ให้นิสิตเขียนโปรแกรมเพื่อพัฒนาเกมดังกล่าว
'''
enter = 0
while enter  != '' :
    print('กติกา')
    print('ผู้เล่นทั้งสองจะสลับกันกรอกข้อมูลตัวเลขจำนวนเต็ม ที่มีค่า 1 จนถึง 13 ')
    print('ถ้าผู้เล่นคนใดกรอกตัวเลขแล้วทำให้ผลรวมของตัวเลขทั้งหมดมีค่ามากกว่า 99 จะถือว่าผู้เล่นคนดังกล่าวแพ้')
    print('กด Enter เพื่อเริ่มเกมส์')
    enter = input()
print('ผู้เล่นคนแรก กรุณากรอกชื่อของคุณ');name_playerA = input()
print('สวัสดีครับ',name_playerA,'คุณเป็นผู้เล่นคนแรก')
print('ผู้เล่นคนที่สอง กรุณากรอกชื่อของคุณ');name_playerB = input()
print('สวัสดีครับ',name_playerB,'คุณเป็นผู้เล่นคนที่สอง')
print('Welcome to the game.')
score = 0
while score < 99 :
    print(name_playerA,'กรุณากรอกหมายเลขด้วยครับ')
    a = int(input())
    while a < 0 or a > 13:
        print(name_playerA,'กรุณากรอกหมายเลขที่อยู่ระหว่าง 0 ถึง 13 ด้วยครับ')
        a = int(input())
    score += a
    if score > 99 :
        print('จบเกมส์')
        print('ผู้ชนะคือ คุณ',name_playerB)
    if score == 99 :
        print('จบเกมส์')
        print('ผู้ชนะคือ คุณ',name_playerA)
    print(name_playerB, 'กรุณากรอกหมายเลขด้วยครับ')
    b=int(input())
    while b < 0 or b > 13:
        print(name_playerB,'กรุณากรอกหมายเลขที่อยู่ระหว่าง 0 ถึง 13 ด้วยครับ')
        b = int(input())
    score += b
    if score > 99 :
        print('จบเกมส์')
        print('ผู้ชนะคือ คุณ', name_playerA)
    if score == 99 :
        print('จบเกมส์')
        print('ผู้ชนะคือ คุณ',name_playerB)
print('score =',score)
'''


